{"caption": "A character design reference sheet for Kei, a young girl with black pigtails and a skateboard, wearing a striped t-shirt and a baseball cap. The sheet includes a full-body turnaround with three views: front-facing, back-facing, and side-facing. Additionally, it features close-up facial expressions showing strong emotions: happy, sad, angry, and neutral. The style is 3D animation, designed for children's television, with bright, expressive features and dynamic poses.", "file_name": "emotions.png"}
{"caption":"Kei is standing in a lively park with green trees, benches, and a skate ramp in the background. She is on her skateboard, looking determined. The environment is bright and colorful, designed in a 3D animation style for children's television.","file_name":"6a5279ec-34dc-4106-888d-4937c09b650c.png"}
{"caption":"Kei is sitting on the ground and crying after scraping her knee while skateboarding. The character style matches a 3D animated children's television design, with exaggerated, expressive features and a bright, colorful environment. The character should have the same outfit and hairstyle as in the reference, with strong emotional expressions.", "file_name":"knee.png"}
{"caption":"Kei is sitting on the ground and crying after scraping her knee while skateboarding. The character design matches a 3D animated television style, featuring exaggerated, expressive features.","file_name":"09e944e4-ff12-4d0a-a4d3-9d8a70e8c120.png"}
{"caption": "Kei is performing a kickflip at a skate park, concentrating hard. The character style closely matches a 3D animated television design with expressive, exaggerated features, inspired by the reference image. Her facial expressions and outfit details, including the striped shorts and wristbands, match the reference style.", "file_name":"stance.png"}
{"caption":"Kei is performing a kickflip at a skate park, concentrating hard. The scene is in a bright and colorful 3D animated television style, with exaggerated, expressive features.","file_name":"cfec00b3-9749-4ba4-a41e-d26f7d8228fa.png"}
{"caption":"Kei is laying in bed in a messy room. The character design matches the reference sheet, with expressive exaggerated features, thick eyebrows, a slightly mischievous look, and strong emotional expressions. The style is a 3D animated children's television design with a bright, colorful environment.","file_name":"24456ef1-5de5-4893-b28f-bf55706361f6.png"}
{"caption":"Kei laying in bed. She has a tired expression, with eyes half-closed and a slightly open mouth, conveying exhaustion. The scene is viewed from above, with a messy room visible around her. The character matches the reference image in skin color, racial features, and hairstyle, ensuring consistency in design. The character style is in 3D animated children's television design, with exaggerated, expressive features and a bright, colorful environment.","file_name":"room.png"}
{"caption":"Kei is holding her skateboard beside her. The background is a realistic park setting with trees, grass, and a paved walkway. The pose is natural and relaxed, with her legs slightly bent and her hands resting on the bench. The scene is bright and colorful, designed in a children's television animation style. The outfit and hairstyle should precisely match the reference image.","file_name":"112d9360-76bc-453e-a07d-0752cd8b4fe2.png"}
{"caption":"Kei sits on a park bench in the afternoon. View from behind. She has her skateboard resting beside her. The background is a realistic park setting with trees, grass, and a paved walkway. The pose is natural and relaxed, with her legs slightly bent and her hands resting on the bench. The scene is bright and colorful, designed in a children's television animation style. The outfit and hairstyle should precisely match the reference image.","file_name":"93473612-55f5-4a3b-8e46-b2157643e47f.png"}
{"caption":"Kei is sitting at a desk with a bored expression. The character style matches a 3D animated children's television design, with exaggerated, expressive features and a bright, colorful environment.","file_name":"desk.png"}
{"caption":"Kei is sitting at a desk with a bored expression. The character style matches a 3D animated children's television design, with exaggerated, expressive features and a bright, colorful environment.","file_name":"3.png"}
{"caption":"Kei is waving at the camera with a friendly expression. The character's proportions and style should match the reference image, with exaggerated, expressive features suitable for a 3D animated children's television design. The environment is bright and colorful.","file_name":"wave.png"}
{"caption":"Kei waves at the camera with a friendly expression. The character's proportions and style should match the reference image, with exaggerated, expressive features suitable for a 3D animated children's television design. The environment is bright and colorful.","file_name":"wave2"}
{"caption":"A side view of Kei in different poses, such as standing confidently with one hand on her hip or adjusting her cap. The character's proportions and style should match the reference image, with exaggerated, expressive features suitable for a 3D animated children's television design. The environment is bright and colorful.","file_name":"brim.png"}
{"caption":"Kei sits on the floor next to her bed, in her bedroom. She looks content and has a teal skateboard tucked inder her knees.","file_name":"1.png"}
{"caption":"Kei from a 3/4ths view, shoulders up, on a plain white background. She has a determined expression.","file_name":"10.png"}
{"caption":"Kei looks at the camera with a defiant, frustrated expression. Reference image on a plain grey background.","file_name":"11.png"}
{"caption":"Kei stands on her skateboard, one foot hanging off the edge. She faces at an angle to the camera, with a determined expression. High contrast.","file_name":"12.png"}
{"caption":"A side view reference of Kei. She is standing in a neutral pose, slightly leaning forward. The background is light grey. High contrast.","file_name":"13.png"}
{"caption":"Kei looks to the side and gestures to her forehead. She has a calm expression, and her hair is in a ponytail. The background is plain white. Japanese RPG animation style. High-key, high exposure.","file_name":"14.png"}
{"caption":"A view from the waist up as Kei looks to the side and gestures to her forehead. She has a neutral expression, and her hair is tied back in a ponytail. The background is plain white. Japanese RPG animation style. High brightness, low contrast.","file_name":"15.png"}
{"caption":"Kei faces away from the viewer at a 3/4ths angle. She stands in a neutral pose with her arms at her sides. The background is grey. Low brightness.","file_name":"16.png"}
{"caption":"Kei sits on the ground crying after scraping her knee, which is bandaged. She wears blue overalls and a backpack, and her skateboard lays on the ground behind her. The background is plain periwinkle. Low contrast, low brightness.","file_name":"17.png"}
{"caption":"Kei lays in bed, staring up at the ceiling with a bored, pensive expression. The background is fully rendered, showing her bed and bedroom behind her. View from above. High brightness, low contrast.","file_name":"18.png"}
{"caption":"Action shot as Kei does a kickflip on her skateboard. She is wearing knee pads and looking to the side with a confident smile. The setting is plain grey.","file_name":"19.png"}
{"caption":"Kei crouches on the ground, wearing knee pads and using her arms to balance. She is facing to the side and looking  slightly up at something out of view. She smiles with appreciation. High contrast.","file_name":"20.png"}
{"caption":"Young Kei facing away from the camera at a 3/4ths angle. She stands holding her skateboard and smiles. Plain white background. Low brightness.","file_name":"4.png"}
{"caption":"Kei waves at the viewer. She has a friendly, smiling expression. Grey background. High saturation, low brightness.","file_name":"5.png"}
{"caption":"Full height view of Kei as she holds her skateboard in front of her. She is facing towards the viewer at a 3/4ths angle and smiles. Plain grey background.","file_name":"6.png"}
{"caption":"Kei smiles and waves, facing forward directly at the viewer. Her expression is calm. Blue background. High saturation.","file_name":"7.png"}
{"caption":"Kei smiles and waves, facing at a 3/4ths angle towards the viewer. Her expression is firendly. Blue background. High saturation.","file_name":"8.png"}
{"caption":"Kei faces towrds the viewer from a 3/4ths view, shoulders up, on a plain white background. She has a determined expression. High brightness.","file_name":"9.png"}
{"caption":"Pose reference for young Kei, showing her full body on a plain white background. She poses with her skateboard, facing away from the viewer, and waving, facing towards the viewer. In both poses, she smiles and has a relaxed, happy expression.","file_name":"wave2.png"}
{"caption":"Expression reference for Kei. She faces at a 3/4ths angle towards the camera and smiles with an open mouth. Her expression is excited and hopeful. High brightness.","file_name":"2.png"}
