{"file_name": "23458573.jpg", "caption": "Vash draws his gun from the holster. He looks down, and his coat flares out behind him."}
{"file_name": "24089431.jpg", "caption": "Vash looks to the side with a sad expression. In front of him, Rem erupts into red petals, and they are surrounded by white shards. Background: blue-white gradient."}
{"file_name": "Trigun_Stampede_Episode_5.webp", "caption": "Close up on Vash. He looks over his shoulder at the viewer, with an angry expression, and speaks."}
{"file_name": "23458472.jpg", "caption": "Vash is sitting down, tied up in an industrial setting with blue lighting. He looks up at his captors with a sheepish, scared expression, and his nose is bleeding slightly."}
{"file_name": "23871376.jpg", "caption": "View from above. Vash and Wolfwood walk through a hallway with white light strips on the floor and a red chandelier."}
{"file_name": "23458608.jpg", "caption": "Vash faces to the sign, pointing his gun and leaning in the same direction. He has a distressed, angry expression and is shouting. Background: blue sky"}
{"file_name": "23458610.jpg", "caption": "Side profile as Vash runs through a dusty landscape. His coatbillows around him, and there are pink clouds in the sky."}
{"file_name": "23515887.jpg", "caption": "Side profile as Vash sits at a table in a drab room with Roberto, a man with brown hair and a beard. Behind them, bright white light glows from the windows, which have green curtains."}
{"file_name": "23516546.jpg", "caption": "Close up on Vash. He raises his hand to his head and looks up at the viewer with a pained, sad expression. There is blood on his cheek."}
{"file_name": "Nebraskas_taking_Jeneora_Rock's_plant.webp", "caption": "View from behind. Vash faces off against a mad scientist, featuring his robotic arm. The environment is an industrial desert setting with a blue sky."}
{"file_name": "Trigun_Stampede_Episode_3.png", "caption": "Close up on Vash. He looks up through his glassesat the viewer with a surprised, distressed expression."}
{"file_name": "Trigun_Stampede_Episode_1.webp", "caption": "Close up on Vash. He points his gun up at the viewer, aiming along the sight."}
{"file_name": "Vash_and_Wolfwood_trying_to_move_the_cannon.webp", "caption": "Vash lifts the industrial, metal ceiling above him. He looks to the side with an expression of exertion and anger."}
{"file_name": "23516534.jpg", "caption": "Vash kneels on the ground, touching a doll with lots of screws and nails pointing out of it. He Looks down at the doll with a focused, distressed expression."}
{"file_name": "23458279.jpg", "caption": "Vash sits on the ground in the desert with his legs crossed. He manually adjusts the wrist of his mechanical arm and looks down at it with a gentle, calm expression."}
{"file_name": "23516388.jpg", "caption": "Close up on Vash. He smiles at the viewer with closed eyes. Background: blue."}
{"file_name": "23458442.jpg", "caption": "Close up on Vash. He looks to the side with a concerned expression and a drop of sweat on his cheek."}
{"file_name": "Trigun_Stampede_Episode_11.webp", "caption": "Close up on Vash. He stares at the viewer with a surprised expression, mouth open. Background: lush, natural scenery."}
{"file_name": "23458278.jpg", "caption": "Vash sits on the ground in the desert with his legs crossed. He manually adjusts the wrist of his mechanical arm. He looks to the side, talking, and his glasses reflect the blue sky."}
{"file_name": "23871389.jpg", "caption": "View from behind. Vash and Wolfwood walk through a hallway with white light strips on the floor and red ceiling lights."}
{"file_name": "Vash_and_Wolfwood_surrounded_by_July_police.webp", "caption": "Vash raises his hands in surrender, with a smiling, nervous expression on his face. The environment is dark, lit from the side."}
{"file_name": "23458366.jpg", "caption": "View from behind. Vash stands, tied up with rope. He faces towards a woman in a brown dress, in a dilapidated, dark saloon."}
{"file_name": "23516765.jpg", "caption": "Vash stands in industrial ruins. He walks away from Roberto, a man with brown hair and a beard who kneels on the ground. Roberto is arresting a villain with blue hair and spikes., who sits on the ground."}
{"file_name": "23458565.jpg", "caption": "Vash stands at sunset, turning to face the viewer. He looks over his shoulder at the viewer with a concerned expression. Background: pink and purple sunset gradient. "}
{"file_name": "23516571.jpg", "caption": "Vash leans to the side, in profile view. His hair is messy, and he looks to the side with a concentrated, stern expression."}
{"file_name": "Vash_dodging_Chuck's_gun.webp", "caption": "Someone is pointing a gun at Vash. He looks down at the gun with surprise. The environment is windy, and his hair and coat blow in the wind. Background: blue/pink sunset gradient."}
{"file_name": "24089089.jpg", "caption": "Close up on Vash. he looks down and to the side and speaks with a sad, surprised expression."}
{"file_name": "23517028.jpg", "caption": "In a dark room, Vash points his gun up and to the side. He looks along the sight of the gun with a distressed, scared expression."}
{"file_name": "23458256.jpg", "caption": "View from behind. Vash is tied up with rope and hangs upside-down."}
{"file_name": "Meryl_and_Roberto_meet_Vash.webp", "caption": "Vash is tied up with rope and hangs upside-down. He has a large smile, and his glasses reflect the desert landscape."}
{"file_name": "23458323.jpg", "caption": "In the desert, Vash is tied up with rope, standing and facing towards the side. He is speaking."}
{"file_name": "23871502.jpg", "caption": "Close up on Vash. He reaches up towards the viewer and looks up with a concerned, curious expression. The lighting is pink."}
{"file_name": "23516650.jpg", "caption": "Vash shuffles though industrial ruins, hunching over and kicking up dust as he drags his feet."}
